chapter10/recirculationControlInletOutlet/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
   (0 1 0)
   (1 1 0)
   (1 2 0)
   (0 2 0)

   (0 1 0.1)
   (1 1 0.1)
   (1 2 0.1)
   (0 2 0.1)

   (3 1 0)
   (3 2 0)
   (3 1 0.1)
   (3 2 0.1)

   (1 0 0)
   (3 0 0)
   (1 0 0.1)
   (3 0 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 40 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (120 40 1) simpleGrading (1 1 1)
    hex (12 13 8 1 14 15 10 5) (120 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)
            (8 10 15 13)
        );
    }

    upperWall
    {
        type wall;
        faces
        (
            (2 6 11 9)
            (3 7 6 2)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (12 14 5 1)
            (12 13 15 14)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (14 15 10 5)
            (0 3 2 1)
            (1 2 9 8)
            (12 1 8 13)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
